app/controllers/api/pins_controller.rb

SELECT "pins".* FROM "pins"
---
    def index
        # debugger
        @pins = Pin.all

INSERT INTO "pins" ("title", "details", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["details", "hell0"], ["user_id", 33], ["created_at", "2022-03-08 06:09:45.082351"], ["updated_at", "2022-03-08 06:09:45.082351"]]
---
    def create
        @pin = Pin.new(pin_params)
        if @pin.save

UPDATE "pins" SET "updated_at" = $1 WHERE "pins"."id" = $2  [["updated_at", "2022-03-08 06:51:39.089625"], ["id", 13]]
---
    def update
        @pin = Pin.find(params[:id])
        if @pin.update(pin_params)