app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "sZcYhAEDjQZu2+4eYX4MkA=="], ["updated_at", "2022-03-03 15:51:46.336415"], ["id", 6]]